[
  {
    "id": "guerrier",
    "name": "Guerrier",
    "description": "Spécialiste du combat rapproché, le Guerrier excelle dans la défense et l'attaque avec des armes lourdes. Sa résistance et sa force en font un combattant redoutable en première ligne.",
    "color": "var(--color-guerrier)",
    "icon": "gavel",
    "stats": {
      "damage": 8,
      "defense": 9,
      "mobility": 5,
      "utility": 3
    },
    "abilities": [
      {
        "name": "Frappe Puissante",
        "description": "Une attaque lourde qui inflige d'importants dégâts et étourdit les ennemis proches.",
        "cooldown": "10 secondes"
      },
      {
        "name": "Cri de Guerre",
        "description": "Augmente temporairement les dégâts et la défense des alliés proches.",
        "cooldown": "30 secondes"
      },
      {
        "name": "Mur de Bouclier",
        "description": "Bloque toutes les attaques frontales pendant 5 secondes.",
        "cooldown": "25 secondes"
      }
    ],
    "playstyle": "Le Guerrier est idéal pour les joueurs qui préfèrent être au cœur de l'action. Sa robustesse permet de protéger les alliés plus fragiles tout en infligeant des dégâts constants. Bien que lent, sa puissance en combat direct est inégalée."
  },
  {
    "id": "mage",
    "name": "Mage",
    "description": "Manipulateur des arcanes, le Mage utilise des sorts puissants pour infliger d'énormes dégâts à distance. Sa maîtrise des éléments lui permet de contrôler le champ de bataille.",
    "color": "var(--color-mage)",
    "icon": "switch_access_shortcut",
    "stats": {
      "damage": 10,
      "defense": 3,
      "mobility": 4,
      "utility": 8
    },
    "abilities": [
      {
        "name": "Nova Arcanique",
        "description": "Libère une explosion d'énergie arcanique qui inflige des dégâts importants aux ennemis dans une zone.",
        "cooldown": "12 secondes"
      },
      {
        "name": "Barrière de Glace",
        "description": "Crée une barrière qui bloque les projectiles et ralentit les ennemis qui la traversent.",
        "cooldown": "18 secondes"
      },
      {
        "name": "Téléportation",
        "description": "Se téléporte instantanément à un endroit ciblé dans un rayon limité.",
        "cooldown": "20 secondes"
      }
    ],
    "playstyle": "Le Mage excelle dans le contrôle des foules et les dégâts à distance. Sa faible défense est compensée par sa capacité à éliminer les menaces avant qu'elles ne s'approchent. Idéal pour les joueurs stratégiques qui préfèrent analyser le champ de bataille."
  },
  {
    "id": "archer",
    "name": "Archer",
    "description": "Expert en précision à distance, l'Archer peut éliminer ses cibles avant même qu'elles ne le détectent. Sa mobilité lui permet de se repositionner rapidement sur le champ de bataille.",
    "color": "var(--color-archer)",
    "icon": "gps_fixed",
    "stats": {
      "damage": 7,
      "defense": 4,
      "mobility": 9,
      "utility": 5
    },
    "abilities": [
      {
        "name": "Tir Perforant",
        "description": "Une flèche puissante qui traverse plusieurs ennemis en ligne droite.",
        "cooldown": "8 secondes"
      },
      {
        "name": "Pluie de Flèches",
        "description": "Tire plusieurs flèches en l'air qui retombent sur une zone, infligeant des dégâts à tous les ennemis présents.",
        "cooldown": "15 secondes"
      },
      {
        "name": "Bond Arrière",
        "description": "Effectue un saut rapide en arrière tout en tirant une flèche qui ralentit l'ennemi.",
        "cooldown": "10 secondes"
      }
    ],
    "playstyle": "L'Archer est parfait pour les joueurs qui préfèrent garder leurs distances tout en restant mobiles. Sa précision lui permet d'éliminer les cibles prioritaires rapidement, tandis que sa mobilité lui permet d'éviter les dangers."
  },
  {
    "id": "voleur",
    "name": "Voleur",
    "description": "Maître de la furtivité, le Voleur excelle dans les attaques surprises et l'élimination rapide de cibles isolées. Sa discrétion lui permet d'infiltrer les lignes ennemies sans être détecté.",
    "color": "var(--color-voleur)",
    "icon": "visibility_off",
    "stats": {
      "damage": 9,
      "defense": 2,
      "mobility": 10,
      "utility": 6
    },
    "abilities": [
      {
        "name": "Assassinat",
        "description": "Une attaque dévastatrice qui inflige des dégâts critiques si l'ennemi ne vous a pas détecté.",
        "cooldown": "15 secondes"
      },
      {
        "name": "Voile d'Ombre",
        "description": "Devient invisible pendant quelques secondes, permettant de se déplacer sans être détecté.",
        "cooldown": "20 secondes"
      },
      {
        "name": "Poison Mortel",
        "description": "Applique un poison puissant sur l'arme qui inflige des dégâts continus à la cible.",
        "cooldown": "25 secondes"
      }
    ],
    "playstyle": "Le Voleur convient aux joueurs qui apprécient les approches furtives et les éliminations rapides. Sa capacité à se faufiler derrière les lignes ennemies en fait un excellent assassin, mais sa faible défense requiert une bonne gestion du positionnement."
  },
  {
    "id": "soigneur",
    "name": "Soigneur",
    "description": "Gardien de la vie, le Soigneur maintient ses alliés en vie grâce à ses puissants sorts de guérison et de protection. Son soutien est essentiel dans les combats difficiles.",
    "color": "var(--color-soigneur)",
    "icon": "heart_broken",
    "stats": {
      "damage": 4,
      "defense": 5,
      "mobility": 6,
      "utility": 10
    },
    "abilities": [
      {
        "name": "Vague de Guérison",
        "description": "Soigne tous les alliés dans une zone autour du lanceur.",
        "cooldown": "12 secondes"
      },
      {
        "name": "Bénédiction Protectrice",
        "description": "Applique un bouclier sur un allié qui absorbe une certaine quantité de dégâts.",
        "cooldown": "15 secondes"
      },
      {
        "name": "Résurrection",
        "description": "Ramène à la vie un allié tombé au combat avec une partie de sa santé.",
        "cooldown": "60 secondes"
      }
    ],
    "playstyle": "Le Soigneur est crucial pour le groupe, maintenant les alliés en vie pendant les affrontements. Idéal pour les joueurs qui préfèrent soutenir plutôt qu'attaquer directement, le Soigneur doit rester vigilant et réactif aux besoins de son équipe."
  },
  {
    "id": "tank",
    "name": "Tank",
    "description": "Maître des créatures, le tank commande une armée de serviteurs pour combattre à ses côtés. Sa capacité à créer des alliés temporaires le rend redoutable en combat prolongé.",
    "color": "var(--color-tank)",
    "icon": "shield",
    "stats": {
      "damage": 6,
      "defense": 5,
      "mobility": 3,
      "utility": 9
    },
    "abilities": [
      {
        "name": "Invocation de Golem",
        "description": "Invoque un puissant golem qui combat pour le lanceur pendant 30 secondes.",
        "cooldown": "25 secondes"
      },
      {
        "name": "Essaim d'Esprits",
        "description": "Libère plusieurs esprits qui attaquent automatiquement les ennemis proches.",
        "cooldown": "18 secondes"
      },
      {
        "name": "Lien Vital",
        "description": "Crée un lien avec une créature invoquée, partageant santé et pouvoirs augmentés.",
        "cooldown": "30 secondes"
      }
    ],
    "playstyle": "L'Tank est parfait pour les joueurs stratégiques qui aiment gérer plusieurs unités simultanément. Sa force réside dans sa capacité à contrôler le champ de bataille et à s'adapter à différentes situations grâce à ses nombreuses invocations."
  }
]
